Catalogs/ВидыДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыДисконтныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OnLine</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накопительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПоУсловию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМонетарности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМонетарности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыМонетарности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыМонетарности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитнаяДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитнаяКонтрагент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДисконтныхКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	//Костенюк Александр-Старт 17.06.2014
	Элементы.ГруппаСтраницаПараметры.Видимость = (Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная);
	Элементы.ГруппаСтраницаУсловияСкидок.Видимость = (Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная);
	//Костенюк Александр-Финиш 17.06.2014
	
	// Настройка формы.
	Если Объект.СкидкаПоУсловию Тогда
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Элементы.ГруппаСтраницаУсловияСкидок.Видимость = Истина;
		Элементы.ДекорацияОтступ.Видимость = Ложь;

	Иначе
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ГруппаСтраницаУсловияСкидок.Видимость = Ложь;
		Элементы.ДекорацияОтступ.Видимость = Истина;
		
	КонецЕсли;
	
	// Элементы.
	Элементы.Накопительная.Доступность = (Не Объект.ТипМонетарности = Перечисления.ТипыМонетарности.НеИспользуется);
	Элементы.Оплата.Доступность = Элементы.Накопительная.Доступность;
	
КонецПроцедуры // РасширенныеНастройкиНаСервере()


&НаКлиенте
Процедура OnLineПриИзменении(Элемент)

	Объект.Локальная = Не Объект.OnLine;
	
КонецПроцедуры // OnLineПриИзменении()

&НаКлиенте
Процедура СкидкаПоУсловиюПриИзменении(Элемент)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
	Если Элементы.ГруппаСтраницаУсловияСкидок.Видимость Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаУсловияСкидок;
	КонецЕсли; 

КонецПроцедуры // СкидкаПоУсловиюПриИзменении()

&НаКлиенте
Процедура ТипМонетарностиПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ТипМонетарности) Тогда
		Объект.ТипМонетарности = ПредопределенноеЗначение("Перечисление.ТипыМонетарности.НеИспользуется");
	КонецЕсли; 
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();

КонецПроцедуры // ТипМонетарностиПриИзменении()


&НаКлиенте
Процедура УсловияСкидокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.УсловияСкидок.ТекущиеДанные;
	
	Если НоваяСтрока И Копирование Тогда
		ТекущиеДанные.Ссылка = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // УсловияСкидокПриНачалеРедактирования()

&НаКлиенте
Процедура УсловияСкидокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущиеДанные = Элементы.УсловияСкидок.ТекущиеДанные;

	Если (Не ТекущиеДанные = Неопределено) Тогда
		Если ПустаяСтрока(ТекущиеДанные.Наименование) Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
				ТекущиеДанные.Наименование = __ОбщегоНазначенияСервер.ПолучитьЗначение(ТекущиеДанные.Ссылка, "Наименование", Истина);
			Иначе
				УсловияСкидок.Удалить(ТекущиеДанные);
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // УсловияСкидокПриОкончанииРедактирования()

&НаКлиенте
Процедура УсловияСкидокПередУдалением(Элемент, Отказ)

	ТекущиеДанные = Элементы.УсловияСкидок.ТекущиеДанные;

	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		
		Отказ = Истина;
		
		ТекущиеДанные.ПометкаУдаления = Не ТекущиеДанные.ПометкаУдаления;
		ТекущиеДанные.ИндексКартинки = ТекущиеДанные.ПометкаУдаления;
	
	КонецЕсли; 
	
КонецПроцедуры // УсловияСкидокПередУдалением()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Данные.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Условия скидок.
	Справочники.УсловияСкидок.ПолучитьУсловияСкидокВидаДисконтнойКарты(ТекущийОбъект, УсловияСкидок);
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Условия скидок.
	Справочники.УсловияСкидок.УстановитьУсловияСкидокВидаДисконтнойКарты(ТекущийОбъект, УсловияСкидок, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Объект.СкидкаПоУсловию Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "УсловияСкидок");
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаКлиенте
//Костенюк Александр-Старт 17.06.2014
Процедура ТипКартыПриИзменении(Элемент)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры
//Костенюк Александр-Финиш 17.06.2014
